'''
Напишіть програму, яка запитує користувача номер дня тижня, а
потім виводить назву дня тижня. При введенні неправильних
даних програма повинна видати відповідне повідомлення.
'''
while True:
    print('Введіть номер дня тижня. Q для виходу: ')
    x = input()
    if x.upper() == 'Q':
        break
    try:
        int(x) # Перевіряємо чи число
    except:
        print("Це не число")
        continue
    if 8 > int(x) > 0:
        if x == '1':
            print('%s день тижня це понеділок' % x)
        elif x == '2':
            print('%s день тижня це вівторок' % x)
        elif x == '3':
            print('%s день тижня це середа' % x)
        elif x == '4':
            print('%s день тижня це четвер' % x)
        elif x == '5':
            print('%s день тижня це пятниця' % x)
        elif x == '6':
            print('%s день тижня це субота' % x)
        else:
            print('%s день тижня це неділя' % x)
    else:
        print('%s не підходить, попробуйте від 1 до 7' % x)

