'''
Вводиться рядок слів, розділених пробілами. Знайти найдовше
слово і вивести його на екран. Випадок, коли найдовших слів може бути
кілька, не обробляти.
'''

s = '''Вводиться рядок слів, розділених пробілами. Знайти найдовше слово і вивести його на екран. Випадок, коли найдовших слів може бути кілька, не обробляти '''

a = ''
l_a = 0
b = ''
l_b = 0
sp_c = 0

for i in s:
    if i != ' ':
        if sp_c == 0:
            a += i
            l_a += 1
        elif sp_c == 1:
            b += i
            l_b += 1
        else:
            if l_a < l_b:
                a, l_a = b, l_b
                sp_c = 1
                b = i
                l_b = 1
            else:
                sp_c = 1
                b = i
                l_b = 1
    else:
        sp_c += 1
if l_a < l_b:
    a, l_a = b, l_b
print('У стрічці \"%s\", найдовше слово \"%s\", яке містить %s букв' % (s, a, l_a))


