print('Завдання 1')

'''
Bвести речення та підрахувати і вивести слова, що
починаються на сполучення літер «св»
'''

s='И тот, в ком светоч разума горит, Дурных деяний в мире не свершит'
l_s = s.split(' ')
k = 0
for i in l_s:
    if i[:2] == 'св':
        k += 1
        print(i)
print('Знайдено слів %d' % k)


print('Завдання 2')

'''
У наведеному тексті вивести слова, що починаються та
закінчуються на однакові літери:
'''

s = 'Такт — зто разум сердца и тот кто его имеет, — хорошо воспитан»'
s = s.lower()
s = s.split(' ')
c = 0
for i in s:
    if i[:1] == i[-1] and len(i) > 1:
        print(i)
        c += 1
    else:
        continue
print('Знайдено слів %d' % c)


print('Завдання 3')

'''
Ввести речення та визначити і вивести найкоротше слово:
'''

s = 'Наука есть не что иное, как отображение действительности'
m = set(s.split(' '))
k = {}
for i in m:
    k[i] = len(i)
min_k = min(k.values())
c = 0
for i in k.items():
    if i[1] == min_k:
        c += 1
        print('Найкоротше слово ' + i[0])
print('Знайдено найкоротших слів: ' + str(c))


print('Завдання 4')

'''
Приведеного списку прізвищ вивести прізвища, що починаються
на літеру «с» та закінчуються на літеру «в».
'''

surnames = ['Стасів', 'Батьків', 'Семків', 'Купрієнко', 'Бойко', 'Степанів']
for i in surnames:
    if i[0] == 'С' and i[-1] == 'в':
        print(i)


print('Завдання 5')

'''
Визначити, скільки разів у введеному реченні повторюється
літера «о»:
'''

s = 'Непреодолимого на свете нет ничего'
l = sum([i == 'о' for i in s])
print(l)


print('Завдання 6')

'''
У введеному тексті програмними засобами видалити між
словами всі символи, що не є літерами.
'''

s = input('Введіть текст на російській мові: ')
p=0
while p < len(s):
    if s[p] == ' ':
        if ord(s[p-1]) <1040 or ord(s[p-1]) >1103: #Не буква
            s = s[:p-1] + s[p:]
            p = p - 1
        if p == len(s)-1:
            break
        if ord(s[p + 1]) < 1040 or ord(s[p + 1]) > 1103:  # Не буква
            s = s[:p+1] + s[p + 2:]
            p = p - 1
    p += 1
print(s)


print('Завдання 7')

'''
Увести текст: «Мёд в лесу медведь нашёл — мало мёда много
пчёл».  Вивести слова,що починаються на літеру «М» або «м».
'''
s = 'Мёд в лесу медведь нашёл — мало мёда много пчёл».  Вивести слова, що починаються на літеру «М» або «м».'
s = s.lower()
s = s.split(' ')
for i in s:
    if i[0] == 'м':
       print(i)


print('Завдання 8')

'''
Увести деяку кількість слів та визначити три найдовших слова.
'''

s = input('Введіть слова розділені пробілом: ')
l = s.split(' ')
l.sort(key=lambda x: len(x), reverse=True)
for i in range(0,3):
    print(l[i] + ' має довжину ' + str(len(l[i])))


print('Завдання 9')

'''
Увести список прізвищ, що розташовані у довільному порядку,
та відсортувати його за алфавітом.
'''
surnames = ['Миросів', 'Франко', 'Петрик', 'Тенюх', 'Кушнір', 'Савчук']
surnames.sort(key=lambda f: f[0])
print(surnames)


print('Завдання 10')

'''
Увести будь-яке речення і визначити, скільки разів
повторюється в ньому задане слово.
'''
s = input('Введіть речення:')
zv = ',.!?:;'
for i in s:
    for j in i:
        if j in zv:
            s = s.replace(str(j), '')
w = input('Введіть слово, щоб дізнатись скільки раз воно повторюється у цьому реченні: ')
s = s.lower()
s = s.split(' ')
k = 0
for i in s:
    if i == w:
        k += 1
print('Слово ' + w + ' повторюється ' + str(k) + ' раз у введеному реченні')



print('Завдання 11')
'''
Даний текст розбити на слова і вивести їх за алфавітом:
«Слово — поступок, а понимание — начало согласия».
'''
s = 'Слово —поступок, а понимание —начало согласия'
s = s.lower()
zv = ',.!?:;—-'
for i in s:
    for j in i:
        if j in zv:
            s = s.replace(str(j), '')
s = s.split(' ')
s.sort(key=lambda x: x[0])
print(s)



print('Завдання 12')

'''
З введеного списку прізвищ вивести ті, що мають дві
голосні літери.
'''
surnames = ['Миросів', 'Франко', 'Петрик', 'Тенюх', 'Кушнір', 'Савчук']
v_let = ['а', 'у', 'е', 'о', 'и', 'і']
c = 0
for i in surnames:
    for l in i:
        if l in v_let:
            c += 1
    if c == 2:
        print(i)
    c = 0


print('Завдання 13')

'''
Увести вірш та вивести слова, що починаються на літери
«с» або «п»:

«Во всём мне хочется дойти
До самой сути:
В работе, в поисках пути,
В сердечной смуте».

'''
s = 'Во всём мне хочется дойти ' \
    'До самой сути: ' \
    'В работе, в поисках пути, ' \
    'В сердечной смуте'

l = s.split(' ')
for i in l:
    if i[0] == 'с' or i[0] == 'п':
        print(i)
    else:
        continue