'''
Задано масив з 30 дійсних чисел. Знайти елемент (індекс), який
має максимальне значення в масиві.
'''
m = 0
s = [20, 5, 3, 175, 10, 4]
for i in range(0, len(s)):
    if s[i] > s[m]:
        m = i
print("Индекс найбильшого елемента " + str(m))

'''
Задано масив з 50 цілих чисел. Знайти позицію (позиції)
елементу, що має мінімальне значення. Якщо таких елементів
декілька, сформувати додатковий масив індексів.
'''
m = 0
s = [20, 5, 3, 175, 10, 4]
for i in range(0, len(s)):
    if s[i] < s[m]:
        m = i
print("Позиція найменшого елемента " + str(m+1))
