'''
Задано масив з 30 дійсних чисел. Знайти елемент (індекс), який
має максимальне значення в масиві.
'''
m = 0
s = [20, 5, 3, 175, 10, 4]
for i in range(0, len(s)):
    if s[i] > s[m]:
        m = i
print("Индекс найбильшого елемента " + str(m))

'''
Задано масив з 50 цілих чисел. Знайти позицію (позиції)
елементу, що має мінімальне значення. Якщо таких елементів
декілька, сформувати додатковий масив індексів.
'''
m = 0
s = [20, 5, 1, 1, 10, 4, 1]
min = []
for i in range(0, len(s)):
    if s[i] <= s[m]:
        if s[i] < s[m]:
             m = i
        elif i > 0 and s[i] == s[m]:
            min.append(i)
min.append(m)
print("Позиції найменшого елемента " + str(min))