'''
 Визначити, чи рік, введений з клавіатури є високосним.
(Високосний рік ділиться на 4, і при цьому не ділиться на 100
або якщо ділиться на 400.)
 Перевірити, чи коректна дата введена з
клавіатури(наприклад, перевіряємо 01,03,05,07,08,10,12
місяці на 31 день і так далі..)
 Визначити завтрашн ю дату
'''

x = input('Введіть рік: ')
print(x + ' рік є високосним') if int(x) % 4 == 0 and int(x) % 100 != 0 else print(x + ' рік не є високосним')

x = input('Введіть дату розділену крапками: ')
sp_x = x.split('.')
print(sp_x)
try:
    int(sp_x[2])
    if int(sp_x[0]) < 1 or int(sp_x[0]) > 31:
        print('Не коректне число')
    elif int(sp_x[1]) < 1 or int(sp_x[1]) > 12:
        print('Не коректний місяць')
    else:
        print('Дата коректна')
except:
    print('Не числове значення')
