'''
У квадрат вписано коло.
a. Визначити площу заштрихованої частини
фігури. Довжину сторони квадрата увести
з клавіатури
'''
while True:
    a = input('Введіть довжину сторони квадрата. Q для виходу: ')
    if a.upper() == 'Q':
        break
    try:
        f_a = float(a)
    except:
        print("Ви ввели не коректні значення")
        continue
    s_q = f_a**2
    print('S квадрата %s см2' % s_q)
    s_c = 3.14*f_a**2/4
    print('S кола %s см2' % s_c)
    h = (s_q-s_c)/2
    print('Площа заштрихованої частини фігури %s см' % h)
    '''
    Визначити площу не заштрихованої
    частини фігури. Радіус кола увечти з
    клавіатури
    '''
    r = input('Введіть радіус кола. Q для виходу: ')
    if r.upper() == 'Q':
        break
    try:
        f_r = float(r)
    except:
        print("Ви ввели не коректні значення")
        continue
    s_q = (f_r*2)**2
    print('S квадрата %s см2' % s_q)
    s_c = 3.14*f_r**2
    print('S кола %s см2' % s_c)
    h = s_c+(s_q-s_c)/2
    print('Площа незаштрихованої фігури %s см' % h)
