'''
З клавіатури вводиться вік трьох людей. Визначити хто з них
старший. Нехай людей позначимо через A,B,C. Якщо двоє
однакового віку і страші за третього, то потрібнл через пробіл
вивести їхні позначки. Якщо вони всі однакового віку, то
виводиться 0
'''

p = {}
try:
    p['a'] = int(input('Введіть вік першої людини: '))
    p['b'] = int(input('Введіть вік другої людини: '))
    p['c'] = int(input('Введіть вік третьої людини: '))
except ValueError:
    print('Некоректне значення')
else:
    m = max(p.values())
    s = ''
    if p['a'] == p['b'] == p['c']:
        print(0)
    else:
        for k, v in p.items():
            if v == m:
                s += k+' '
    print(s)

